address_samples = {
    'Ваш адрес Московская обл, Истра г.о., дп. Миллениум-парк (вблизи д. Обушково), кв-л. 5, д. 46. Верно?':
    'Ваш адрес Московская область, Истра городской округ, дп. Миллениум-парк '
    '(вблизи деревня Обушково), квартал 5, дом 46. Верно?',
    'Ваш адрес Московская обл, Люберцы г.о., дп. Малаховка, Быковское ш, д. 61, кв. 46 . Верно?':
    'Ваш адрес Московская область, Люберцы городской округ, дп. Малаховка, '
    'Быковское шоссе, дом 61, квартира 46 . Верно?',
    'Ваш адрес Московская обл, г. Люберцы, Октябрьский пр-кт, д. 9, кв. 40 . Верно?':
    'Ваш адрес Московская область, город Люберцы, Октябрьский проспект, дом 9, квартира 40 . Верно?',
    'Ваш адрес Московская обл, Истра г.о., с/пос. Бужаровское, дпк. Истринский плес (д.Верхуртово)':
    'Ваш адрес Московская область, Истра городской округ, сельское поселение '
    'Бужаровское, дпк. Истринский плес (деревня Верхуртово)',
    'Ваш адрес Московская обл, Истра г.о., с/о. Лучинский, с. Лучинское, Заречная ул, д. 19, кв. 2 .':
    'Ваш адрес Московская область, Истра городской округ, сельский округ '
    'Лучинский, село Лучинское, Заречная улица, дом 19, квартира 2 .',
    'Ваш адрес Московская обл, Истра г.о., с/пос. Бужаровское, снт. Ефимоново, Садовый туп, д. 182 . Верно?':
    'Ваш адрес Московская область, Истра городской округ, сельское поселение '
    'Бужаровское, снт. Ефимоново, Садовый тупик, дом 182 . Верно?',
    'Ваш адрес Московская обл, г. Чехов, Вишневый б-р, д. 4А, кв. 88 . Верно?':
    'Ваш адрес Московская область, город Чехов, Вишневый бульвар, дом 4А, '
    'квартира 88 . Верно?',
    'Ваш адрес Московская обл, Луховицы г.о., пгт. Белоомут, Большая Площадь ул, д. 40 . Верно?':
    'Ваш адрес Московская область, Луховицы городской округ, посёлок городского '
    'типа Белоомут, Большая Площадь улица, дом 40 . Верно?',
    'Ваш адрес Московская обл, Щелково г.о., п. Образцово, Садовая ул, д. 20 . Верно?':
    'Ваш адрес Московская область, Щелково городской округ, посёлок Образцово, '
    'Садовая улица, дом 20 . Верно?',
    'Ваш адрес Московская обл, Наро-Фоминский г.о., тер. ДНП Лесное, уч. 189, уч.189 . Верно?':
    'Ваш адрес Московская область, Наро-Фоминский городской округ, тер. ДНП '
    'Лесное, участок 189, участок 189 . Верно?',
    'мкр. Опалиха, Северная ул, д. 20/27, кв. 1 . Верно?':
    'микрорайон Опалиха, Северная улица, дом 20 дробь 27, квартира 1 . Верно?',
    'Ваш адрес г. Москва, поселение. Вороновское, с. Вороново, д. 26. Верно?':
    'Ваш адрес город Москва, поселение. Вороновское, село Вороново, дом 26. Верно?',
    'Ваш адрес Московская обл, Ступино г.о., тер. СНТ ДСО Северка-90, д. 151, кв. 2 . Верно?':
    'Ваш адрес Московская область, Ступино городской округ, тер. СНТ ДСО Северка '
    '90, дом 151, квартира 2 . Верно?',
    'Ваш адрес г. Москва, поселение. Щаповское, д. Александрово, д. 51, кв. 1 . Верно?':
    'Ваш адрес город Москва, поселение. Щаповское, деревня Александрово, дом 51, '
    'квартира 1 . Верно?',
    'Адрес ближайшего офиса - - - - - - - ул. миклухо-маклая. - - - - .д. 47 а. - - - - - - .':
    'Адрес ближайшего офиса улица миклухо-маклая. .дом 47 а. .',
    'Интернет-заказ на выдачу Ваш заказ готов к выдаче г. Новосибирск, ул. Петропавловская д. 2 в пункте nsk':
    'Интернет-заказ на выдачу Ваш заказ готов к выдаче город Новосибирск, улица '
    'Петропавловская дом 2 в пункте nsk',
    'Интернет-заказ на выдачу Ваш заказ готов к выдаче г. Белгород, ул. Губкина д. 29 в пункте bel':
    'Интернет-заказ на выдачу Ваш заказ готов к выдаче город Белгород, улица '
    'Губкина дом 29 в пункте bel',
    'Заказ для Вас укомплектован, ожидает отгрузки. ТК Энергия до г. серов':
    'Заказ для Вас укомплектован, ожидает отгрузки. ТК Энергия до города серов',
    'Интернет-заказ на выдачу  готов к выдаче по адресу г.Москва, ул. Маршала Бирюзова 4 к.   1':
    'Интернет-заказ на выдачу готов к выдаче по адресу город Москва, улица '
    'Маршала Бирюзова 4 корпус 1',
    'Интернет-заказ на выдачу  готов к выдаче по адресу г Ярославль, ул. Чкалова д. 62':
    'Интернет-заказ на выдачу готов к выдаче по адресу город Ярославль, улица '
    'Чкалова дом 62',
    'Интернет-заказ на выдачу  готов к выдаче по адресу г.Тула ул. Кутузова, 41':
    'Интернет-заказ на выдачу готов к выдаче по адресу город Тула улица Кутузова, 41',
    'Интернет-заказ на выдачу  готов к выдаче по адрес г.     Кемерово, ул. Тухачевского д. 50/4':
    'Интернет-заказ на выдачу готов к выдаче по адрес город Кемерово, улица '
    'Тухачевского дом 50 дробь 4',
    'Интернет-заказ на выдачу  готов к выдаче по адресу г.  Уфа, ул.Конституции д.2':
    'Интернет-заказ на выдачу готов к выдаче по адресу город Уфа, улица Конституции дом 2',
    'Интернет-заказ на выдачу  готов к выдаче по адресу г.Н. Новгород ул. Юлиуса Фучика, 11':
    'Интернет-заказ на выдачу готов к выдаче по адресу г.Н. Новгород улица Юлиуса Фучика, 11',
    'Ближайший магазин находится по адресу город гатчина, улица чехова, дом 11+а.':
    'Ближайший магазин находится по адресу город гатчина, улица чехова, дом 11 а.',
    'Интернет-заказ на выдачу  готов к выдаче по адресу г.Новосибирск, ул.Петропавловская, д.2 кв.6':
    'Интернет-заказ на выдачу готов к выдаче по адресу город Новосибирск, улица '
    'Петропавловская, дом 2 квартира 6',
    'ул  петрова стр.   10 кв.   58   д.   62а':
    'улица петрова строение 10 квартира 58 дом 62 а'}

phone_samples = {
    '79270511899': 'семь девятьсот двадцать семь пятьдесят один восемнадцать девяносто девять',
    '88574582536': 'восемь восемьсот пятьдесят семь четыреста пятьдесят восемь двадцать пять тридцать шесть',
    '+78525236584': 'семь восемьсот пятьдесят два пятьсот двадцать три шестьдесят пять восемьдесят четыре',
    '+79170281520': 'семь девятьсот семнадцать двадцать восемь пятнадцать двадцать'}

personal_samples = {
    'hedralicct@gmail.com': 'хедраликкт собака гмаил точка ком',
    'wew@yandex.ru': 'вев собака яндекс точка ру',
    'legowelt собака mail точка com': 'леговелт собака маил точка ком',
    'ziax.ru': 'зиакс точка ру',
    'vk.com': 'вк точка ком',
    'debil.de': 'дебил точка де',
    'pouet.net': 'пует точка нет',
    'www.audiomania.ru': 'ввв точка аудиоманиа точка ру',
    'https://www.vk.com': 'ввв точка вк точка ком',
    'www.dopesite.ua': 'ввв точка допесите точка уа',
    'file:///home/milo/test.txt': 'филе хоме мило тест точка ткст',
    'bash.org.ru': 'баш точка орг точка ру'}

ordinal_samples = {
    '1-й': 'первый',
    '2-го': 'второго',
    '3-го': 'третьего',
    '4-й': 'четвертый',
    '5-м': 'пятым',
    '6-ом': 'шестом',
    '10-м': 'десятым',
    '21-м': 'двадцать первым',
    '1-ая': 'первая',
    '2-я': 'вторая',
    '10-ой': 'десятой',
    '3-е': 'третье',
    '3-ю': 'третью',
    '2-ую': 'вторую',
    '3-ей': 'третьей',
    'о 5-ом': 'о пятом',
    '90-е': 'девяностые',
    '50-х': 'пятидесятых',
    '70-х': 'семидесятых',
    '101-х': 'сто первых',
    # Num2words ошибается на этом слове
    # '80-х': 'восьмидесятых',
    # Редкий кейс, пока не умеет
    # '2000-е': 'двухтысячные',
    '1090-х': 'тысяча девяностых',
    '1980-е': 'одна тысяча девятьсот восемидесятые'}

decimal_samples = {
    '2,5': 'два с половиной',
    '11,5': 'одиннадцать с половиной',
    'после 4,3': 'после четырёх целых трёх десятых',
    '12,5-13,5': 'двенадцать с половиной-тринадцать с половиной',
    '0,5-2,5': 'ноль целых пять десятых-два с половиной',
    '0,004': 'ноль целых четыре тысячных',
    '0,7': 'ноль целых семь десятых',
    # Пофиксить 'Две сотых' -> 'Два сотых', 'Одна сотых' -> 'Один сотых'
    # '0,02 - 0,3': 'ноль целых две сотых ноль целых три десятых',
    '0,256': 'ноль целых двести пятьдесят шесть тысячных'}

time_samples = {
    '00:01': 'ноль часов ноль одна минута',
    '02:30': 'два часа тридцать минут',
    '15:25': 'пятнадцать часов двадцать пять минут',
    '18:19': 'восемнадцать часов девятнадцать минут',
    '20:20': 'двадцать часов двадцать минут',
    'до 15:52': 'до пятнадцати часов пятидесяти двух минут',
    '20:21': 'двадцать часов двадцать одна минута',
    'после 17:30': 'после семнадцати часов тридцати минут',
    '00:00': 'ноль часов ровно',
    'более 15:35': 'более пятнадцати часов тридцати пяти минут',
    'работаем до 23:00': 'работаем до двадцати трёх часов ровно',
    'я встаю в 6:15': 'я встаю в шесть часов пятнадцать минут',
    'я ложусь в 23:00': 'я ложусь в двадцать три часа ровно',
    'с 9:00 до 14:15': 'с девяти часов ровно до четырнадцати часов пятнадцати минут',
    # Не умеет в интервалы времени, '-' == 'до'. Пока: `с девяти часов ровно десять часов ровно`
    # 'с 9:00-10:00': 'с девяти часов ровно до десяти часов ровно',
    'с 8:00, после 17:21': 'с восьми часов ровно, после семнадцати часов двадцать одной минуты'}

date_samples = {
    '14.05': 'четырнадцатого мая',
    '15.03': 'пятнадцатого марта',
    '29.12': 'двадцать девятого декабря',
    '02.05.12': 'второго мая две тысячи двенадцатого года',
    '06.07.60': 'шестого июля одна тысяча девятьсот шестидесятого года',
    '05.07.2009': 'пятого июля две тысячи девятого года',
    '08.07.2012': 'восьмого июля две тысячи двенадцатого года',
    '21.05.1960': 'двадцать первого мая одна тысяча девятьсот шестидесятого года',
    '5.02': 'пятого февраля',
    'после 28.05.98': 'после двадцать восьмого мая одна тысяча девятьсот девяносто восьмого года',
    '15.08.84': 'пятнадцатого августа одна тысяча девятьсот восемьдесят четвёртого года',
    'до 02.02.65': 'до второго февраля одна тысяча девятьсот шестьдесят пятого года'}

ordinal_date_samples = {
    '12 марта': 'двенадцатого марта',
    '9 февраля': 'девятого февраля',
    '15 марта': 'пятнадцатого марта',
    '22 июня': 'двадцать второго июня',
    '28 февраля': 'двадцать восьмого февраля'}

measure_samples = {
    '5 м': 'пять метров',
    '10 см': 'десять сантиметров',
    '28 см': 'двадцать восемь сантиметров'}

prep_samples = {
    'с 11': 'с одиннадцати',
    'с 5': 'с пяти',
    'с 12': 'с двенадцати',
    'со 100': 'со ста',
    'с 1000': 'с одной тысячи',
    'с 200': 'с двухсот',
    'с 1520': 'с одной тысячи пятисот двадцати',
    'с 16824': 'с шестнадцати тысяч восьмисот двадцати четырёх',
    'с 1324': 'с одной тысячи трехсот двадцати четырёх',
    'с 52': 'с пятидесяти двух',
    'при 3': 'при трёх',
    'в течение 15': 'в течение пятнадцати',
    'менее 30': 'менее тридцати',
    'больше 18': 'больше восемнадцати',
    'от 250': 'от двухсот пятидесяти',
    'после 16': 'после шестнадцати',
    'для 28': 'для двадцати восьми'}

latin_samples = {
    'debonaire': 'дебонер',
    'shit': 'шит',
    'lol': 'лол',
    'bmw': 'бмв',
    'tepleco': 'теплеко'}

number_samples = {
    '158200': 'сто пятьдесят восемь тысяч двести',
    '4578': 'четыре тысячи пятьсот семьдесят восемь',
    '15': 'пятнадцать'}
